public class Task2 {
    /*
*Дан одномерный массив символов.
* Преобразовать его в одномерный массив чисел, где число - это код символа
* (любой символ - это число в памяти компьютера).
* Например: [‘a’, ‘6’, ‘y’, ‘P’, ‘T’, ‘q’, ‘9’, ‘+’] -> [97, 54, 121, 80, 84, 113, 57, 43]
* Далее определить среднее арифметическое всех элементов целочисленного массива и вывести на
* консоль только те элементы,
* которые больше этого среднего арифметического.
     */
    public static void main(String[] args) {
        int[] valuems = {'d', '+', 'q', '=', '9', 'L'};
    }
    public static void numberCode(int[] valuems){
        int arrayNum[valuems.length];
        for (int i = 0; i < valuems.length; i++) {
            arrayNum[i] = valuems.length[i];
            
        }
        

    }
}
